OpenDTEF-v1912/tutorials/combustion/PDRFoam/flamePropagationWithObstacles/Allrun
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

restore0Dir
runApplication blockMesh
runApplication changeDictionary
runApplication topoSet

runApplication PDRMesh -overwrite

runApplication $(getApplication)

#------------------------------------------------------------------------------
